
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>实践练习 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="practice/001.html" />
    
    
    <link rel="prev" href="try-flink/004.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    入门
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="try-flink/local.html">
            
                <a href="try-flink/local.html">
            
                    
                    本地模式安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="try-flink/002.html">
            
                <a href="try-flink/002.html">
            
                    
                    基于DataStream API实现欺诈检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="try-flink/003.html">
            
                <a href="try-flink/003.html">
            
                    
                    基于Table API实现实时报表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.4" data-path="try-flink/004.html">
            
                <a href="try-flink/004.html">
            
                    
                    一个Flink操作场景
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="practice.html">
            
                <a href="practice.html">
            
                    
                    实践练习
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="practice/001.html">
            
                <a href="practice/001.html">
            
                    
                    DataStream API 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="practice/002.html">
            
                <a href="practice/002.html">
            
                    
                    数据管道 & ETL
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="practice/003.html">
            
                <a href="practice/003.html">
            
                    
                    流式分析
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="flink-china.html">
            
                <a href="flink-china.html">
            
                    
                    Flink 中国社区文档
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="flink-china/setdeployrun.html">
            
                <a href="flink-china/setdeployrun.html">
            
                    
                    Flink 环境搭建、配置、部署及运行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="flink-china/datastream-api.html">
            
                <a href="flink-china/datastream-api.html">
            
                    
                    DataStream API
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="flink-china/client.html">
            
                <a href="flink-china/client.html">
            
                    
                    客户端操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="flink-china/time-window.html">
            
                <a href="flink-china/time-window.html">
            
                    
                    Time&Window
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="flink-china/state-fault-tolerance.html">
            
                <a href="flink-china/state-fault-tolerance.html">
            
                    
                    状态管理和容错机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="flink-china/table-api.html">
            
                <a href="flink-china/table-api.html">
            
                    
                    Table API
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="wai-lian.html">
            
                <a href="wai-lian.html">
            
                    
                    外链
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >实践练习</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x6982;&#x89C8;">&#x6982;&#x89C8;</h3>
<p>Apache Flink &#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x53EF;&#x6269;&#x5C55;&#x5E76;&#x884C;&#x5EA6;&#x7684;ETL&#x3001;&#x6570;&#x636E;&#x5206;&#x6790;&#x4EE5;&#x53CA;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x6D41;&#x5F0F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<h4 id="1&#x3001;&#x6D41;&#x5904;&#x7406;">1&#x3001;&#x6D41;&#x5904;&#x7406;</h4>
<p>&#x81EA;&#x7136;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x4EA7;&#x751F;&#x662F;&#x6D41;&#x5F0F;&#x7684;&#x3002;&#x5206;&#x6790;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x56F4;&#x7ED5;&#x6709;&#x754C;&#x6D41;&#x548C;&#x65E0;&#x754C;&#x6D41;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#x6765;&#x7EC4;&#x7EC7;&#x5904;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x548C;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x4E5F;&#x4F1A;&#x4E0D;&#x540C;&#x3002;</p>
<p><img src="assets/bounded-unbounded.png" alt="Bounded and unbounded streams"></p>
<p><strong>&#x6279;&#x5904;&#x7406;</strong>&#xFF1A;&#x6709;&#x754C;&#x6570;&#x636E;&#x6D41;&#x5904;&#x7406;&#x7684;&#x8303;&#x4F8B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5728;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x8F93;&#x51FA;&#x4E4B;&#x524D;&#x8F93;&#x5165;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x5BF9;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3001;&#x7EDF;&#x8BA1;&#x6216;&#x6C47;&#x603B;&#x8BA1;&#x7B97;&#x540E;&#x518D;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x3002;</p>
<p><strong>&#x6D41;&#x5904;&#x7406;</strong>&#xFF1A;&#x6D89;&#x53CA;&#x65E0;&#x754C;&#x6570;&#x636E;&#x6D41;&#x3002;&#x7406;&#x8BBA;&#x4E0A;&#x8BF4;&#xFF0C;&#x6570;&#x636E;&#x8F93;&#x5165;&#x6C38;&#x4E0D;&#x7ED3;&#x675F;&#xFF0C;&#x56E0;&#x6B64;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x5730;&#x5BF9;&#x5230;&#x8FBE;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p>&#x5728; Flink &#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7531;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;<strong>&#x7B97;&#x5B50;</strong>&#x8F6C;&#x6362;&#x800C;&#x6765;&#x7684;<strong>&#x6D41;&#x5F0F; dataflows</strong> &#x6240;&#x7EC4;&#x6210;&#x3002;&#x8FD9;&#x4E9B;&#x6D41;&#x5F0F; dataflows &#x5F62;&#x6210;&#x4E86;&#x6709;&#x5411;&#x56FE;&#xFF0C;&#x4EE5;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;<strong>&#x6E90;</strong>&#xFF08;source&#xFF09;&#x5F00;&#x59CB;&#xFF0C;&#x5E76;&#x4EE5;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;<strong>&#x6C47;</strong>&#xFF08;sink&#xFF09;&#x7ED3;&#x675F;&#x3002;</p>
<p><img src="assets/program_dataflow.svg" alt="A DataStream program, and its dataflow."></p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x7684; transformation &#x548C; dataflow &#x4E2D;&#x7684;&#x7B97;&#x5B50;&#xFF08;operator&#xFF09;&#x4E4B;&#x95F4;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#x3002;&#x4F46;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E2A; transformation &#x5305;&#x542B;&#x591A;&#x4E2A;&#x7B97;&#x5B50;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p>Flink &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x6D88;&#x8D39;&#x6765;&#x81EA;&#x6D88;&#x606F;&#x961F;&#x5217;&#x6216;&#x5206;&#x5E03;&#x5F0F;&#x65E5;&#x5FD7;&#x8FD9;&#x7C7B;&#x6D41;&#x5F0F;&#x6570;&#x636E;&#x6E90;&#xFF08;&#x4F8B;&#x5982; Apache Kafka &#x6216; Kinesis&#xFF09;&#x7684;&#x5B9E;&#x65F6;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x5404;&#x79CD;&#x7684;&#x6570;&#x636E;&#x6E90;&#x4E2D;&#x6D88;&#x8D39;&#x6709;&#x754C;&#x7684;&#x5386;&#x53F2;&#x6570;&#x636E;&#x3002;&#x540C;&#x6837;&#xFF0C;Flink &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x7684;&#x7ED3;&#x679C;&#x6D41;&#x4E5F;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x5230;&#x5404;&#x79CD;&#x6570;&#x636E;&#x6C47;&#x4E2D;&#x3002;</p>
<p><img src="assets/flink-application-sources-sinks.png" alt="Flink application with sources and sinks"></p>
<h4 id="2&#x3001;&#x5E76;&#x884C;-dataflows">2&#x3001;&#x5E76;&#x884C; Dataflows</h4>
<p>Flink &#x7A0B;&#x5E8F;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x5E76;&#x884C;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x671F;&#x95F4;&#xFF0C;&#x4E00;&#x4E2A;&#x6D41;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;<strong>&#x6D41;&#x5206;&#x533A;</strong>&#xFF08;Stream Partition&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x7B97;&#x5B50;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;<strong>&#x7B97;&#x5B50;&#x5B50;&#x4EFB;&#x52A1;</strong>&#xFF08;Operator Subtask&#xFF09;&#x3002;&#x6BCF;&#x4E2A;&#x5B50;&#x4EFB;&#x52A1;&#x5F7C;&#x6B64;&#x72EC;&#x7ACB;&#xFF0C;&#x5E76;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x6216;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x5BB9;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x7B97;&#x5B50;&#x5B50;&#x4EFB;&#x52A1;&#x6570;&#x5C31;&#x662F;&#x5176;&#x5BF9;&#x5E94;&#x7B97;&#x5B50;&#x7684;<strong>&#x5E76;&#x884C;&#x5EA6;</strong>&#x3002;&#x5728;&#x540C;&#x4E00;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x4E0D;&#x540C;&#x7B97;&#x5B50;&#x4E5F;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5E76;&#x884C;&#x5EA6;&#x3002;</p>
<p><img src="assets/parallel_dataflow.svg" alt="A parallel dataflow"></p>
<p>Flink &#x7B97;&#x5B50;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<em>&#x4E00;&#x5BF9;&#x4E00;</em>&#xFF08;<em>&#x76F4;&#x4F20;</em>&#xFF09;&#x6A21;&#x5F0F;&#x6216;<em>&#x91CD;&#x65B0;&#x5206;&#x53D1;</em>&#x6A21;&#x5F0F;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF1A;</p>
<ul>
<li><strong>&#x4E00;&#x5BF9;&#x4E00;</strong>&#x6A21;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;&#x7684; <em>Source</em> &#x548C; <em>map()</em> &#x7B97;&#x5B50;&#x4E4B;&#x95F4;&#xFF09;&#x53EF;&#x4EE5;&#x4FDD;&#x7559;&#x5143;&#x7D20;&#x7684;&#x5206;&#x533A;&#x548C;&#x987A;&#x5E8F;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740; <em>map()</em> &#x7B97;&#x5B50;&#x7684; subtask[1] &#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x5176;&#x987A;&#x5E8F;&#x4E0E; <em>Source</em> &#x7B97;&#x5B50;&#x7684; subtask[1] &#x8F93;&#x51FA;&#x7684;&#x6570;&#x636E;&#x548C;&#x987A;&#x5E8F;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#xFF0C;&#x5373;&#x540C;&#x4E00;&#x5206;&#x533A;&#x7684;&#x6570;&#x636E;&#x53EA;&#x4F1A;&#x8FDB;&#x5165;&#x5230;&#x4E0B;&#x6E38;&#x7B97;&#x5B50;&#x7684;&#x540C;&#x4E00;&#x5206;&#x533A;&#x3002;</li>
<li><strong>&#x91CD;&#x65B0;&#x5206;&#x53D1;</strong>&#x6A21;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;&#x4E0A;&#x56FE;&#x4E2D;&#x7684; <em>map()</em> &#x548C; <em>keyBy/window</em> &#x4E4B;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA; <em>keyBy/window</em> &#x548C; <em>Sink</em> &#x4E4B;&#x95F4;&#xFF09;&#x5219;&#x4F1A;&#x66F4;&#x6539;&#x6570;&#x636E;&#x6240;&#x5728;&#x7684;&#x6D41;&#x5206;&#x533A;&#x3002;&#x5F53;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684; <em>transformation</em>&#xFF0C;&#x6BCF;&#x4E2A;<em>&#x7B97;&#x5B50;&#x5B50;&#x4EFB;&#x52A1;</em>&#x4E5F;&#x4F1A;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684; transformation &#x5C06;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x6807;&#x5B50;&#x4EFB;&#x52A1;&#x3002;&#x4F8B;&#x5982;&#x4EE5;&#x4E0B;&#x8FD9;&#x51E0;&#x79CD; transformation &#x548C;&#x5176;&#x5BF9;&#x5E94;&#x5206;&#x53D1;&#x6570;&#x636E;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;<em>keyBy()</em>&#xFF08;&#x901A;&#x8FC7;&#x6563;&#x5217;&#x952E;&#x91CD;&#x65B0;&#x5206;&#x533A;&#xFF09;&#x3001;<em>broadcast()</em>&#xFF08;&#x5E7F;&#x64AD;&#xFF09;&#x6216; <em>rebalance()</em>&#xFF08;&#x968F;&#x673A;&#x91CD;&#x65B0;&#x5206;&#x53D1;&#xFF09;&#x3002;&#x5728;<em>&#x91CD;&#x65B0;&#x5206;&#x53D1;</em> &#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5143;&#x7D20;&#x53EA;&#x6709;&#x5728;&#x6BCF;&#x5BF9;&#x8F93;&#x51FA;&#x548C;&#x8F93;&#x5165;&#x5B50;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x624D;&#x80FD;&#x4FDD;&#x7559;&#x5176;&#x4E4B;&#x95F4;&#x7684;&#x987A;&#x5E8F;&#x4FE1;&#x606F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;<em>keyBy/window</em> &#x7684; subtask[2] &#x63A5;&#x6536;&#x5230;&#x7684; <em>map()</em> &#x7684; subtask[1] &#x4E2D;&#x7684;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#x7684; <em>keyBy/window</em> &#x548C; <em>Sink</em> &#x7B97;&#x5B50;&#x4E4B;&#x95F4;&#x6570;&#x636E;&#x7684;&#x91CD;&#x65B0;&#x5206;&#x53D1;&#x65F6;&#xFF0C;&#x4E0D;&#x540C;&#x952E;&#xFF08;key&#xFF09;&#x7684;&#x805A;&#x5408;&#x7ED3;&#x679C;&#x5230;&#x8FBE; Sink &#x7684;&#x987A;&#x5E8F;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x3002;</li>
</ul>
<h4 id="3&#x3001;&#x65F6;&#x95F4;&#x6D41;&#x5904;&#x7406;">3&#x3001;&#x65F6;&#x95F4;&#x6D41;&#x5904;&#x7406;</h4>
<p>&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x6D41;&#x6570;&#x636E;&#x5904;&#x7406;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x800C;&#x8A00;&#xFF0C;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x5904;&#x7406;&#x5B9E;&#x65F6;&#x6570;&#x636E;&#x7684;&#x4EE3;&#x7801;&#x91CD;&#x65B0;&#x5904;&#x7406;&#x5386;&#x53F2;&#x6570;&#x636E;&#x5E76;&#x4EA7;&#x751F;&#x786E;&#x5B9A;&#x5E76;&#x4E00;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#x975E;&#x5E38;&#x6709;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x5728;&#x5904;&#x7406;&#x6D41;&#x5F0F;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x66F4;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x4E8B;&#x4EF6;&#x672C;&#x8EAB;&#x53D1;&#x751F;&#x7684;&#x987A;&#x5E8F;&#x800C;&#x4E0D;&#x662F;&#x4E8B;&#x4EF6;&#x88AB;&#x4F20;&#x8F93;&#x4EE5;&#x53CA;&#x5904;&#x7406;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x63A8;&#x7406;&#x51FA;&#x4E00;&#x7EC4;&#x4E8B;&#x4EF6;&#xFF08;&#x4E8B;&#x4EF6;&#x96C6;&#x5408;&#xFF09;&#x662F;&#x4F55;&#x65F6;&#x53D1;&#x751F;&#x4EE5;&#x53CA;&#x7ED3;&#x675F;&#x7684;&#x3002;&#x4F8B;&#x5982;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x4EA4;&#x6613;&#x6216;&#x91D1;&#x878D;&#x4EA4;&#x6613;&#x4E2D;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x4E8B;&#x4EF6;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x4E0A;&#x8FF0;&#x8FD9;&#x7C7B;&#x7684;&#x5B9E;&#x65F6;&#x6D41;&#x5904;&#x7406;&#x573A;&#x666F;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;&#x8BB0;&#x5F55;&#x5728;&#x6570;&#x636E;&#x6D41;&#x4E2D;&#x7684;&#x4E8B;&#x4EF6;&#x65F6;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x673A;&#x5668;&#x65F6;&#x949F;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x3002;</p>
<h4 id="4&#x3001;&#x6709;&#x72B6;&#x6001;&#x6D41;&#x5904;&#x7406;">4&#x3001;&#x6709;&#x72B6;&#x6001;&#x6D41;&#x5904;&#x7406;</h4>
<p>Flink &#x4E2D;&#x7684;&#x7B97;&#x5B50;&#x53EF;&#x4EE5;&#x662F;&#x6709;&#x72B6;&#x6001;&#x7684;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x4F55;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x53EF;&#x80FD;&#x53D6;&#x51B3;&#x4E8E;&#x8BE5;&#x4E8B;&#x4EF6;&#x4E4B;&#x524D;&#x6240;&#x6709;&#x4E8B;&#x4EF6;&#x6570;&#x636E;&#x7684;&#x7D2F;&#x79EF;&#x7ED3;&#x679C;&#x3002;Flink &#x4E2D;&#x7684;&#x72B6;&#x6001;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x573A;&#x666F;&#xFF08;&#x4F8B;&#x5982;&#x7EDF;&#x8BA1;&#x4EEA;&#x8868;&#x677F;&#x4E0A;&#x6BCF;&#x5206;&#x949F;&#x663E;&#x793A;&#x7684;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x573A;&#x666F;&#xFF08;&#x4F8B;&#x5982;&#x8BAD;&#x7EC3;&#x4F5C;&#x5F0A;&#x68C0;&#x6D4B;&#x6A21;&#x578B;&#xFF09;&#x3002;</p>
<p>Flink &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7FA4;&#x96C6;&#x4E0A;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x7B97;&#x5B50;&#x7684;&#x5404;&#x4E2A;&#x5E76;&#x884C;&#x5B9E;&#x4F8B;&#x4F1A;&#x5728;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x4F1A;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x6709;&#x72B6;&#x6001;&#x7B97;&#x5B50;&#x7684;&#x5E76;&#x884C;&#x5B9E;&#x4F8B;&#x7EC4;&#x5728;&#x5B58;&#x50A8;&#x5176;&#x5BF9;&#x5E94;&#x72B6;&#x6001;&#x65F6;&#x901A;&#x5E38;&#x662F;&#x6309;&#x7167;&#x952E;&#xFF08;key&#xFF09;&#x8FDB;&#x884C;&#x5206;&#x7247;&#x5B58;&#x50A8;&#x7684;&#x3002;&#x6BCF;&#x4E2A;&#x5E76;&#x884C;&#x5B9E;&#x4F8B;&#x7B97;&#x5B50;&#x8D1F;&#x8D23;&#x5904;&#x7406;&#x4E00;&#x7EC4;&#x7279;&#x5B9A;&#x952E;&#x7684;&#x4E8B;&#x4EF6;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x7EC4;&#x952E;&#x5BF9;&#x5E94;&#x7684;&#x72B6;&#x6001;&#x4F1A;&#x4FDD;&#x5B58;&#x5728;&#x672C;&#x5730;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#x56FE;&#x7684; Flink &#x4F5C;&#x4E1A;&#xFF0C;&#x5176;&#x524D;&#x4E09;&#x4E2A;&#x7B97;&#x5B50;&#x7684;&#x5E76;&#x884C;&#x5EA6;&#x4E3A; 2&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A; sink &#x7B97;&#x5B50;&#x7684;&#x5E76;&#x884C;&#x5EA6;&#x4E3A; 1&#xFF0C;&#x5176;&#x4E2D;&#x7B2C;&#x4E09;&#x4E2A;&#x7B97;&#x5B50;&#x662F;&#x6709;&#x72B6;&#x6001;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7B2C;&#x4E8C;&#x4E2A;&#x7B97;&#x5B50;&#x548C;&#x7B2C;&#x4E09;&#x4E2A;&#x7B97;&#x5B50;&#x4E4B;&#x95F4;&#x662F;&#x5168;&#x4E92;&#x8054;&#x7684;&#xFF08;fully-connected&#xFF09;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5206;&#x53D1;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684; Flink &#x7A0B;&#x5E8F;&#x662F;&#x4E3A;&#x4E86;&#x901A;&#x8FC7;&#x67D0;&#x4E9B;&#x952E;&#x5BF9;&#x6570;&#x636E;&#x6D41;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x9700;&#x8981;&#x4E00;&#x8D77;&#x5904;&#x7406;&#x7684;&#x4E8B;&#x4EF6;&#x8FDB;&#x884C;&#x6C47;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x505A;&#x7EDF;&#x4E00;&#x8BA1;&#x7B97;&#x5904;&#x7406;&#x3002;</p>
<p><img src="assets/parallel-job.png" alt="State is sharded"></p>
<p>Flink &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x72B6;&#x6001;&#x8BBF;&#x95EE;&#x90FD;&#x5728;&#x672C;&#x5730;&#x8FDB;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x5176;&#x63D0;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x548C;&#x964D;&#x4F4E;&#x5EF6;&#x8FDF;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B; Flink &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x5C06;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#x5728; JVM &#x5806;&#x4E0A;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x72B6;&#x6001;&#x592A;&#x5927;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5C06;&#x5176;&#x4EE5;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x5B58;&#x50A8;&#x5728;&#x9AD8;&#x901F;&#x78C1;&#x76D8;&#x4E2D;&#x3002;</p>
<p><img src="assets/local-state.png" alt="State is local"></p>
<h4 id="5&#x3001;&#x901A;&#x8FC7;&#x72B6;&#x6001;&#x5FEB;&#x7167;&#x5B9E;&#x73B0;&#x7684;&#x5BB9;&#x9519;">5&#x3001;&#x901A;&#x8FC7;&#x72B6;&#x6001;&#x5FEB;&#x7167;&#x5B9E;&#x73B0;&#x7684;&#x5BB9;&#x9519;</h4>
<p>&#x901A;&#x8FC7;&#x72B6;&#x6001;&#x5FEB;&#x7167;&#xFF08;state snapshot&#xFF09;&#x548C;&#x6D41;&#x91CD;&#x653E;&#xFF08;stream replay&#xFF09;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x7EC4;&#x5408;&#xFF0C;Flink &#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x53EF;&#x5BB9;&#x9519;&#x7684;&#xFF0C;&#x7CBE;&#x786E;&#x4E00;&#x6B21;&#xFF08;exactly-once&#xFF09;&#x8BA1;&#x7B97;&#x7684;&#x8BED;&#x4E49;&#x3002;&#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#x5FEB;&#x7167;&#x5728;&#x6267;&#x884C;&#x65F6;&#x4F1A;&#x83B7;&#x53D6;&#x5E76;&#x5B58;&#x50A8;&#x5206;&#x5E03;&#x5F0F; pipeline &#x4E2D;&#x6574;&#x4F53;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5B83;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x6E90;&#x4E2D;&#x6D88;&#x8D39;&#x6570;&#x636E;&#x7684;&#x504F;&#x79FB;&#x91CF;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x5E76;&#x5C06;&#x6574;&#x4E2A; job graph &#x4E2D;&#x7B97;&#x5B50;&#x83B7;&#x53D6;&#x5230;&#x8BE5;&#x6570;&#x636E;&#xFF08;&#x8BB0;&#x5F55;&#x7684;&#x504F;&#x79FB;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#xFF09;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x8BB0;&#x5F55;&#x5E76;&#x5B58;&#x50A8;&#x4E0B;&#x6765;&#x3002;&#x5F53;&#x53D1;&#x751F;&#x6545;&#x969C;&#x65F6;&#xFF0C;Flink &#x4F5C;&#x4E1A;&#x4F1A;&#x6062;&#x590D;&#x4E0A;&#x6B21;&#x5B58;&#x50A8;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x91CD;&#x7F6E;&#x6570;&#x636E;&#x6E90;&#x4ECE;&#x72B6;&#x6001;&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x4E0A;&#x6B21;&#x6D88;&#x8D39;&#x7684;&#x504F;&#x79FB;&#x91CF;&#x5F00;&#x59CB;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x6D88;&#x8D39;&#x5904;&#x7406;&#x3002;&#x800C;&#x4E14;&#x72B6;&#x6001;&#x5FEB;&#x7167;&#x5728;&#x6267;&#x884C;&#x65F6;&#x4F1A;&#x5F02;&#x6B65;&#x83B7;&#x53D6;&#x72B6;&#x6001;&#x5E76;&#x5B58;&#x50A8;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x903B;&#x8F91;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="try-flink/004.html" class="navigation navigation-prev " aria-label="Previous page: 一个Flink操作场景">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="practice/001.html" class="navigation navigation-next " aria-label="Next page: DataStream API 简介">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"实践练习","level":"1.2","depth":1,"next":{"title":"DataStream API 简介","level":"1.2.1","depth":2,"path":"practice/001.md","ref":"practice/001.md","articles":[]},"previous":{"title":"一个Flink操作场景","level":"1.1.4","depth":2,"path":"try-flink/004.md","ref":"try-flink/004.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"practice.md","mtime":"2021-03-01T09:24:35.505Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-02-08T02:45:06.855Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

